org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0


** DONE First ox-hugo post                                   :org_mode:hugo:
CLOSED: [2020-08-24 Mon 21:51]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: first-ox-hugo-post
:EXPORT_FILE_NAME: index
:END:

*** This is Awesome!

I just installed [[https://github.com/kaushalmodi/ox-hugo][ox-hugo]], an org extension that makes it easy to export org files as hugo posts.

*** Setting Up

On spacemacs it was as easy as adding =ox-hugo= to the list of =dotspacemacs-additional-packages=, along with adding the following to user-config:
#+begin_src elisp
(use-package ox-hugo
  :ensure t          ;Auto-install the package from Melpa (optional)
  :after ox)
#+end_src

Then you're good to go. I'm excited about the way it makes it easy to write posts via org-capture, but I should really be spending more time writing and less time configuring emacs (:

Even though it's easy to setup, I recommend reading through the entire [[https://ox-hugo.scripter.co/][ox-hugo]] documentation, and this [[https://www.shanesveller.com/blog/2018/02/13/blogging-with-org-mode-and-ox-hugo/][blog post]] for more specifics on the workflow.

*** Extra Goodies

I recommend setting up auto-export on saving, org-capture setup.

Personally I like using hugo leaf bundles for all my hugo posts because it helps keep the images organized.


*** Have fun!
